Tekla Open API Reference for Tekla Structures 2025
BentPlate.Thickness Property
 Gets thickness of the bent plate.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Thickness { get; }
Public ReadOnly Property Thickness As Double
	Get
Property Value
Type: Double
See Also
Reference
BentPlate Class
Tekla.Structures.Model Namespace